hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mdf.h
// DFLT0IER Configuration

#define	MDF_DFLT0IER_RFOVRIE			(0x1u<<11)
#define	MDF_DFLT0IER_CKABIE				(0x1u<<10)
#define	MDF_DFLT0IER_SATIE				(0x1u<<9)
#define	MDF_DFLT0IER_SCDIE				(0x1u<<8)
#define	MDF_DFLT0IER_SSOVRIE			(0x1u<<7)
#define	MDF_DFLT0IER_OLDIE				(0x1u<<4)
#define	MDF_DFLT0IER_SSDRIE				(0x1u<<2)
#define	MDF_DFLT0IER_DOVRIE				(0x1u<<1)
#define	MDF_DFLT0IER_FTHIE				(0x1u<<0)

#define	MDF_DFLT0IER_RFOVRIE_B_0X0		(0x0u<<11)
#define	MDF_DFLT0IER_RFOVRIE_B_0X1		(0x1u<<11)
#define	MDF_DFLT0IER_CKABIE_B_0X0		(0x0u<<10)
#define	MDF_DFLT0IER_CKABIE_B_0X1		(0x1u<<10)
#define	MDF_DFLT0IER_SATIE_B_0X0		(0x0u<<9)
#define	MDF_DFLT0IER_SATIE_B_0X1		(0x1u<<9)
#define	MDF_DFLT0IER_SCDIE_B_0X0		(0x0u<<8)
#define	MDF_DFLT0IER_SCDIE_B_0X1		(0x1u<<8)
#define	MDF_DFLT0IER_SSOVRIE_B_0X0		(0x0u<<7)
#define	MDF_DFLT0IER_SSOVRIE_B_0X1		(0x1u<<7)
#define	MDF_DFLT0IER_OLDIE_B_0X0		(0x0u<<4)
#define	MDF_DFLT0IER_OLDIE_B_0X1		(0x1u<<4)
#define	MDF_DFLT0IER_SSDRIE_B_0X0		(0x0u<<2)
#define	MDF_DFLT0IER_SSDRIE_B_0X1		(0x1u<<2)
#define	MDF_DFLT0IER_DOVRIE_B_0X0		(0x0u<<1)
#define	MDF_DFLT0IER_DOVRIE_B_0X1		(0x1u<<1)
#define	MDF_DFLT0IER_FTHIE_B_0X0		(0x0u<<0)
#define	MDF_DFLT0IER_FTHIE_B_0X1		(0x1u<<0)

// DFLT0ISR Configuration

#define	MDF_DFLT0ISR_RFOVRF				(0x1u<<11)
#define	MDF_DFLT0ISR_CKABF				(0x1u<<10)
#define	MDF_DFLT0ISR_SATF				(0x1u<<9)
#define	MDF_DFLT0ISR_SCDF				(0x1u<<8)
#define	MDF_DFLT0ISR_SSOVRF				(0x1u<<7)
#define	MDF_DFLT0ISR_THHF				(0x1u<<6)
#define	MDF_DFLT0ISR_THLF				(0x1u<<5)
#define	MDF_DFLT0ISR_OLDF				(0x1u<<4)
#define	MDF_DFLT0ISR_RXNEF				(0x1u<<3)
#define	MDF_DFLT0ISR_SSDRF				(0x1u<<2)
#define	MDF_DFLT0ISR_DOVRF				(0x1u<<1)
#define	MDF_DFLT0ISR_FTHF				(0x1u<<0)

#define	MDF_DFLT0ISR_RFOVRF_B_0X0		(0x0u<<11)
#define	MDF_DFLT0ISR_RFOVRF_B_0X1		(0x1u<<11)
#define	MDF_DFLT0ISR_CKABF_B_0X0		(0x0u<<10)
#define	MDF_DFLT0ISR_CKABF_B_0X1		(0x1u<<10)
#define	MDF_DFLT0ISR_SATF_B_0X0			(0x0u<<9)
#define	MDF_DFLT0ISR_SATF_B_0X1			(0x1u<<9)
#define	MDF_DFLT0ISR_SCDF_B_0X0			(0x0u<<8)
#define	MDF_DFLT0ISR_SCDF_B_0X1			(0x1u<<8)
#define	MDF_DFLT0ISR_SSOVRF_B_0X0		(0x0u<<7)
#define	MDF_DFLT0ISR_SSOVRF_B_0X1		(0x1u<<7)
#define	MDF_DFLT0ISR_THHF_B_0X0			(0x0u<<6)
#define	MDF_DFLT0ISR_THHF_B_0X1			(0x1u<<6)
#define	MDF_DFLT0ISR_THLF_B_0X0			(0x0u<<5)
#define	MDF_DFLT0ISR_THLF_B_0X1			(0x1u<<5)
#define	MDF_DFLT0ISR_OLDF_B_0X0			(0x0u<<4)
#define	MDF_DFLT0ISR_OLDF_B_0X1			(0x1u<<4)
#define	MDF_DFLT0ISR_RXNEF_B_0X0		(0x0u<<3)
#define	MDF_DFLT0ISR_RXNEF_B_0X1		(0x1u<<3)
#define	MDF_DFLT0ISR_SSDRF_B_0X0		(0x0u<<2)
#define	MDF_DFLT0ISR_SSDRF_B_0X1		(0x1u<<2)
#define	MDF_DFLT0ISR_DOVRF_B_0X0		(0x0u<<1)
#define	MDF_DFLT0ISR_DOVRF_B_0X1		(0x1u<<1)
#define	MDF_DFLT0ISR_FTHF_B_0X0			(0x0u<<0)
#define	MDF_DFLT0ISR_FTHF_B_0X1			(0x1u<<0)

// OEC0CR Configuration

#define	MDF_OEC0CR_OFFSET				(0x3FFFFFFu<<0)
#define	MDF_OEC0CR_OFFSET_0				(0x1u<<0)

// SNPS0DR Configuration

#define	MDF_SNPS0DR_SDR					(0xFFFFu<<16)
#define	MDF_SNPS0DR_SDR_0				(0x1u<<16)
#define	MDF_SNPS0DR_EXTSDR				(0x7Fu<<9)
#define	MDF_SNPS0DR_EXTSDR_0			(0x1u<<9)
#define	MDF_SNPS0DR_MCICDC				(0x1FFu<<0)
#define	MDF_SNPS0DR_MCICDC_0			(0x1u<<0)

// DFLT0DR Configuration

#define	MDF_DFLT0DR_DR					(0xFFFFFFu<<8)
#define	MDF_DFLT0DR_DR_0				(0x1u<<8)

// SITF1CR Configuration

#define	MDF_SITF1CR_SITFACTIVE			(0x1u<<31)
#define	MDF_SITF1CR_STH					(0x1Fu<<8)
#define	MDF_SITF1CR_STH_0				(0x1u<<8)
#define	MDF_SITF1CR_SITFMOD				(0x3u<<4)
#define	MDF_SITF1CR_SITFMOD_0			(0x1u<<4)
#define	MDF_SITF1CR_SCKSRC				(0x3u<<1)
#define	MDF_SITF1CR_SCKSRC_0			(0x1u<<1)
#define	MDF_SITF1CR_SITFEN				(0x1u<<0)

#define	MDF_SITF1CR_SITFACTIVE_B_0X0	(0x0u<<31)
#define	MDF_SITF1CR_SITFACTIVE_B_0X1	(0x1u<<31)
#define	MDF_SITF1CR_SITFMOD_B_0X0		(0x0u<<4)
#define	MDF_SITF1CR_SITFMOD_B_0X1		(0x1u<<4)
#define	MDF_SITF1CR_SITFMOD_B_0X2		(0x2u<<4)
#define	MDF_SITF1CR_SITFMOD_B_0X3		(0x3u<<4)
#define	MDF_SITF1CR_SCKSRC_B_0X0		(0x0u<<1)
#define	MDF_SITF1CR_SCKSRC_B_0X1		(0x1u<<1)
#define	MDF_SITF1CR_SITFEN_B_0X0		(0x0u<<0)
#define	MDF_SITF1CR_SITFEN_B_0X1		(0x1u<<0)

// BSMX1CR Configuration

#define	MDF_BSMX1CR_BSMXACTIVE			(0x1u<<31)
#define	MDF_BSMX1CR_BSSEL				(0x1Fu<<0)
#define	MDF_BSMX1CR_BSSEL_0				(0x1u<<0)

#define	MDF_BSMX1CR_BSMXACTIVE_B_0X0	(0x0u<<31)
#define	MDF_BSMX1CR_BSMXACTIVE_B_0X1	(0x1u<<31)
#define	MDF_BSMX1CR_BSSEL_B_0X0			(0x0u<<0)
#define	MDF_BSMX1CR_BSSEL_B_0X1			(0x1u<<0)
#define	MDF_BSMX1CR_BSSEL_B_0X2			(0x2u<<0)
#define	MDF_BSMX1CR_BSSEL_B_0X3			(0x3u<<0)
#define	MDF_BSMX1CR_BSSEL_B_0X1E		(0x1Eu<<0)
#define	MDF_BSMX1CR_BSSEL_B_0X1F		(0x1Fu<<0)

// DFLT1CR Configuration

#define	MDF_DFLT1CR_DFLTACTIVE			(0x1u<<31)
#define	MDF_DFLT1CR_DFLTRUN				(0x1u<<30)
#define	MDF_DFLT1CR_NBDIS				(0xFFu<<20)
#define	MDF_DFLT1CR_NBDIS_0				(0x1u<<20)
#define	MDF_DFLT1CR_SNPSFMT				(0x1u<<16)
#define	MDF_DFLT1CR_TRGSRC				(0xFu<<12)
#define	MDF_DFLT1CR_TRGSRC_0			(0x1u<<12)
#define	MDF_DFLT1CR_TRGSENS				(0x1u<<8)
#define	MDF_DFLT1CR_ACQMOD				(0x7u<<4)
#define	MDF_DFLT1CR_ACQMOD_0			(0x1u<<4)
#define	MDF_DFLT1CR_FTH					(0x1u<<2)
#define	MDF_DFLT1CR_DMAEN				(0x1u<<1)
#define	MDF_DFLT1CR_DFLTEN				(0x1u<<0)

#define	MDF_DFLT1CR_DFLTACTIVE_B_0X0	(0x0u<<31)
#define	MDF_DFLT1CR_DFLTACTIVE_B_0X1	(0x1u<<31)
#define	MDF_DFLT1CR_DFLTRUN_B_0X0		(0x0u<<30)
#define	MDF_DFLT1CR_DFLTRUN_B_0X1		(0x1u<<30)
#define	MDF_DFLT1CR_NBDIS_B_0X0			(0x0u<<20)
#define	MDF_DFLT1CR_NBDIS_B_0X1			(0x1u<<20)
#define	MDF_DFLT1CR_SNPSFMT_B_0X0		(0x0u<<16)
#define	MDF_DFLT1CR_SNPSFMT_B_0X1		(0x1u<<16)
#define	MDF_DFLT1CR_TRGSRC_B_0X0		(0x0u<<12)
#define	MDF_DFLT1CR_TRGSRC_B_0X1		(0x1u<<12)
#define	MDF_DFLT1CR_TRGSRC_B_0X2		(0x2u<<12)
#define	MDF_DFLT1CR_TRGSRC_B_0XF		(0xFu<<12)
#define	MDF_DFLT1CR_TRGSENS_B_0X0		(0x0u<<8)
#define	MDF_DFLT1CR_TRGSENS_B_0X1		(0x1u<<8)
#define	MDF_DFLT1CR_ACQMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT1CR_ACQMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT1CR_ACQMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT1CR_ACQMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT1CR_ACQMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT1CR_ACQMOD_B_0X5		(0x5u<<4)
#define	MDF_DFLT1CR_FTH_B_0X0			(0x0u<<2)
#define	MDF_DFLT1CR_FTH_B_0X1			(0x1u<<2)
#define	MDF_DFLT1CR_DMAEN_B_0X0			(0x0u<<1)
#define	MDF_DFLT1CR_DMAEN_B_0X1			(0x1u<<1)
#define	MDF_DFLT1CR_DFLTEN_B_0X0		(0x0u<<0)
#define	MDF_DFLT1CR_DFLTEN_B_0X1		(0x1u<<0)

