hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mdf.h
// DFLT1CICR Configuration

#define	MDF_DFLT1CICR_SCALE				(0x3Fu<<20)
#define	MDF_DFLT1CICR_SCALE_0			(0x1u<<20)
#define	MDF_DFLT1CICR_MCICD8			(0x1u<<16)
#define	MDF_DFLT1CICR_MCICD				(0xFFu<<8)
#define	MDF_DFLT1CICR_MCICD_0			(0x1u<<8)
#define	MDF_DFLT1CICR_CICMOD			(0x7u<<4)
#define	MDF_DFLT1CICR_CICMOD_0			(0x1u<<4)
#define	MDF_DFLT1CICR_DATSRC			(0x3u<<0)
#define	MDF_DFLT1CICR_DATSRC_0			(0x1u<<0)

#define	MDF_DFLT1CICR_SCALE_B_0X0		(0x0u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X1		(0x1u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X2		(0x2u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X18		(0x18u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X20		(0x20u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X21		(0x21u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X22		(0x22u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X23		(0x23u<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X2E		(0x2Eu<<20)
#define	MDF_DFLT1CICR_SCALE_B_0X2F		(0x2Fu<<20)
#define	MDF_DFLT1CICR_MCICD8_B_0X0		(0x0u<<16)
#define	MDF_DFLT1CICR_MCICD8_B_0X1		(0x1u<<16)
#define	MDF_DFLT1CICR_MCICD_B_0X0		(0x0u<<8)
#define	MDF_DFLT1CICR_MCICD_B_0X1		(0x1u<<8)
#define	MDF_DFLT1CICR_CICMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT1CICR_CICMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT1CICR_CICMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT1CICR_CICMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT1CICR_CICMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT1CICR_DATSRC_B_0X2		(0x2u<<0)
#define	MDF_DFLT1CICR_DATSRC_B_0X3		(0x3u<<0)

// DFLT1RSFR Configuration

#define	MDF_DFLT1RSFR_HPFC				(0x3u<<8)
#define	MDF_DFLT1RSFR_HPFC_0			(0x1u<<8)
#define	MDF_DFLT1RSFR_HPFBYP			(0x1u<<7)
#define	MDF_DFLT1RSFR_RSFLTD			(0x1u<<4)
#define	MDF_DFLT1RSFR_RSFLTBYP			(0x1u<<0)

#define	MDF_DFLT1RSFR_HPFC_B_0X0		(0x0u<<8)
#define	MDF_DFLT1RSFR_HPFC_B_0X1		(0x1u<<8)
#define	MDF_DFLT1RSFR_HPFC_B_0X2		(0x2u<<8)
#define	MDF_DFLT1RSFR_HPFC_B_0X3		(0x3u<<8)
#define	MDF_DFLT1RSFR_HPFBYP_B_0X0		(0x0u<<7)
#define	MDF_DFLT1RSFR_HPFBYP_B_0X1		(0x1u<<7)
#define	MDF_DFLT1RSFR_RSFLTD_B_0X0		(0x0u<<4)
#define	MDF_DFLT1RSFR_RSFLTD_B_0X1		(0x1u<<4)
#define	MDF_DFLT1RSFR_RSFLTBYP_B_0X0	(0x0u<<0)
#define	MDF_DFLT1RSFR_RSFLTBYP_B_0X1	(0x1u<<0)

// DFLT1INTR Configuration

#define	MDF_DFLT1INTR_INTVAL			(0x7Fu<<4)
#define	MDF_DFLT1INTR_INTVAL_0			(0x1u<<4)
#define	MDF_DFLT1INTR_INTDIV			(0x3u<<0)
#define	MDF_DFLT1INTR_INTDIV_0			(0x1u<<0)

#define	MDF_DFLT1INTR_INTVAL_B_0X0		(0x0u<<4)
#define	MDF_DFLT1INTR_INTVAL_B_0X1		(0x1u<<4)
#define	MDF_DFLT1INTR_INTDIV_B_0X0		(0x0u<<0)
#define	MDF_DFLT1INTR_INTDIV_B_0X1		(0x1u<<0)
#define	MDF_DFLT1INTR_INTDIV_B_0X2		(0x2u<<0)
#define	MDF_DFLT1INTR_INTDIV_B_0X3		(0x3u<<0)

// OLD1CR Configuration

#define	MDF_OLD1CR_OLDACTIVE			(0x1u<<31)
#define	MDF_OLD1CR_ACICD				(0x1Fu<<17)
#define	MDF_OLD1CR_ACICD_0				(0x1u<<17)
#define	MDF_OLD1CR_ACICN				(0x3u<<12)
#define	MDF_OLD1CR_ACICN_0				(0x1u<<12)
#define	MDF_OLD1CR_BKOLD				(0xFu<<4)
#define	MDF_OLD1CR_BKOLD_0				(0x1u<<4)
#define	MDF_OLD1CR_THINB				(0x1u<<1)
#define	MDF_OLD1CR_OLDEN				(0x1u<<0)

#define	MDF_OLD1CR_OLDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_OLD1CR_OLDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_OLD1CR_ACICD_B_0X0			(0x0u<<17)
#define	MDF_OLD1CR_ACICD_B_0X1			(0x1u<<17)
#define	MDF_OLD1CR_ACICN_B_0X0			(0x0u<<12)
#define	MDF_OLD1CR_ACICN_B_0X1			(0x1u<<12)
#define	MDF_OLD1CR_ACICN_B_0X2			(0x2u<<12)
#define	MDF_OLD1CR_ACICN_B_0X3			(0x3u<<12)
#define	MDF_OLD1CR_THINB_B_0X0			(0x0u<<1)
#define	MDF_OLD1CR_THINB_B_0X1			(0x1u<<1)
#define	MDF_OLD1CR_OLDEN_B_0X0			(0x0u<<0)
#define	MDF_OLD1CR_OLDEN_B_0X1			(0x1u<<0)

// OLD1THLR Configuration

#define	MDF_OLD1THLR_OLDTHL				(0x3FFFFFFu<<0)
#define	MDF_OLD1THLR_OLDTHL_0			(0x1u<<0)

// OLD1THHR Configuration

#define	MDF_OLD1THHR_OLDTHH				(0x3FFFFFFu<<0)
#define	MDF_OLD1THHR_OLDTHH_0			(0x1u<<0)

// DLY1CR Configuration

#define	MDF_DLY1CR_SKPBF				(0x1u<<31)
#define	MDF_DLY1CR_SKPDLY				(0x7Fu<<0)
#define	MDF_DLY1CR_SKPDLY_0				(0x1u<<0)

#define	MDF_DLY1CR_SKPBF_B_0X0			(0x0u<<31)
#define	MDF_DLY1CR_SKPBF_B_0X1			(0x1u<<31)
#define	MDF_DLY1CR_SKPDLY_B_0X0			(0x0u<<0)
#define	MDF_DLY1CR_SKPDLY_B_0X1			(0x1u<<0)

// SCD1CR Configuration

#define	MDF_SCD1CR_SCDACTIVE			(0x1u<<31)
#define	MDF_SCD1CR_SCDT					(0xFFu<<12)
#define	MDF_SCD1CR_SCDT_0				(0x1u<<12)
#define	MDF_SCD1CR_BKSCD				(0xFu<<4)
#define	MDF_SCD1CR_BKSCD_0				(0x1u<<4)
#define	MDF_SCD1CR_SCDEN				(0x1u<<0)

#define	MDF_SCD1CR_SCDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_SCD1CR_SCDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_SCD1CR_SCDT_B_0X0			(0x0u<<12)
#define	MDF_SCD1CR_SCDT_B_0X1			(0x1u<<12)
#define	MDF_SCD1CR_SCDEN_B_0X0			(0x0u<<0)
#define	MDF_SCD1CR_SCDEN_B_0X1			(0x1u<<0)

// DFLT1IER Configuration

#define	MDF_DFLT1IER_RFOVRIE			(0x1u<<11)
#define	MDF_DFLT1IER_CKABIE				(0x1u<<10)
#define	MDF_DFLT1IER_SATIE				(0x1u<<9)
#define	MDF_DFLT1IER_SCDIE				(0x1u<<8)
#define	MDF_DFLT1IER_SSOVRIE			(0x1u<<7)
#define	MDF_DFLT1IER_OLDIE				(0x1u<<4)
#define	MDF_DFLT1IER_SSDRIE				(0x1u<<2)
#define	MDF_DFLT1IER_DOVRIE				(0x1u<<1)
#define	MDF_DFLT1IER_FTHIE				(0x1u<<0)

#define	MDF_DFLT1IER_RFOVRIE_B_0X0		(0x0u<<11)
#define	MDF_DFLT1IER_RFOVRIE_B_0X1		(0x1u<<11)
#define	MDF_DFLT1IER_CKABIE_B_0X0		(0x0u<<10)
#define	MDF_DFLT1IER_CKABIE_B_0X1		(0x1u<<10)
#define	MDF_DFLT1IER_SATIE_B_0X0		(0x0u<<9)
#define	MDF_DFLT1IER_SATIE_B_0X1		(0x1u<<9)
#define	MDF_DFLT1IER_SCDIE_B_0X0		(0x0u<<8)
#define	MDF_DFLT1IER_SCDIE_B_0X1		(0x1u<<8)
#define	MDF_DFLT1IER_SSOVRIE_B_0X0		(0x0u<<7)
#define	MDF_DFLT1IER_SSOVRIE_B_0X1		(0x1u<<7)
#define	MDF_DFLT1IER_OLDIE_B_0X0		(0x0u<<4)
#define	MDF_DFLT1IER_OLDIE_B_0X1		(0x1u<<4)
#define	MDF_DFLT1IER_SSDRIE_B_0X0		(0x0u<<2)
#define	MDF_DFLT1IER_SSDRIE_B_0X1		(0x1u<<2)
#define	MDF_DFLT1IER_DOVRIE_B_0X0		(0x0u<<1)
#define	MDF_DFLT1IER_DOVRIE_B_0X1		(0x1u<<1)
#define	MDF_DFLT1IER_FTHIE_B_0X0		(0x0u<<0)
#define	MDF_DFLT1IER_FTHIE_B_0X1		(0x1u<<0)

// DFLT1ISR Configuration

#define	MDF_DFLT1ISR_RFOVRF				(0x1u<<11)
#define	MDF_DFLT1ISR_CKABF				(0x1u<<10)
#define	MDF_DFLT1ISR_SATF				(0x1u<<9)
#define	MDF_DFLT1ISR_SCDF				(0x1u<<8)
#define	MDF_DFLT1ISR_SSOVRF				(0x1u<<7)
#define	MDF_DFLT1ISR_THHF				(0x1u<<6)
#define	MDF_DFLT1ISR_THLF				(0x1u<<5)
#define	MDF_DFLT1ISR_OLDF				(0x1u<<4)
#define	MDF_DFLT1ISR_RXNEF				(0x1u<<3)
#define	MDF_DFLT1ISR_SSDRF				(0x1u<<2)
#define	MDF_DFLT1ISR_DOVRF				(0x1u<<1)
#define	MDF_DFLT1ISR_FTHF				(0x1u<<0)

#define	MDF_DFLT1ISR_RFOVRF_B_0X0		(0x0u<<11)
#define	MDF_DFLT1ISR_RFOVRF_B_0X1		(0x1u<<11)
#define	MDF_DFLT1ISR_CKABF_B_0X0		(0x0u<<10)
#define	MDF_DFLT1ISR_CKABF_B_0X1		(0x1u<<10)
#define	MDF_DFLT1ISR_SATF_B_0X0			(0x0u<<9)
#define	MDF_DFLT1ISR_SATF_B_0X1			(0x1u<<9)
#define	MDF_DFLT1ISR_SCDF_B_0X0			(0x0u<<8)
#define	MDF_DFLT1ISR_SCDF_B_0X1			(0x1u<<8)
#define	MDF_DFLT1ISR_SSOVRF_B_0X0		(0x0u<<7)
#define	MDF_DFLT1ISR_SSOVRF_B_0X1		(0x1u<<7)
#define	MDF_DFLT1ISR_THHF_B_0X0			(0x0u<<6)
#define	MDF_DFLT1ISR_THHF_B_0X1			(0x1u<<6)
#define	MDF_DFLT1ISR_THLF_B_0X0			(0x0u<<5)
#define	MDF_DFLT1ISR_THLF_B_0X1			(0x1u<<5)
#define	MDF_DFLT1ISR_OLDF_B_0X0			(0x0u<<4)
#define	MDF_DFLT1ISR_OLDF_B_0X1			(0x1u<<4)
#define	MDF_DFLT1ISR_RXNEF_B_0X0		(0x0u<<3)
#define	MDF_DFLT1ISR_RXNEF_B_0X1		(0x1u<<3)
#define	MDF_DFLT1ISR_SSDRF_B_0X0		(0x0u<<2)
#define	MDF_DFLT1ISR_SSDRF_B_0X1		(0x1u<<2)
#define	MDF_DFLT1ISR_DOVRF_B_0X0		(0x0u<<1)
#define	MDF_DFLT1ISR_DOVRF_B_0X1		(0x1u<<1)
#define	MDF_DFLT1ISR_FTHF_B_0X0			(0x0u<<0)
#define	MDF_DFLT1ISR_FTHF_B_0X1			(0x1u<<0)

// OEC1CR Configuration

#define	MDF_OEC1CR_OFFSET				(0x3FFFFFFu<<0)
#define	MDF_OEC1CR_OFFSET_0				(0x1u<<0)

// SNPS1DR Configuration

#define	MDF_SNPS1DR_SDR					(0xFFFFu<<16)
#define	MDF_SNPS1DR_SDR_0				(0x1u<<16)
#define	MDF_SNPS1DR_EXTSDR				(0x7Fu<<9)
#define	MDF_SNPS1DR_EXTSDR_0			(0x1u<<9)
#define	MDF_SNPS1DR_MCICDC				(0x1FFu<<0)
#define	MDF_SNPS1DR_MCICDC_0			(0x1u<<0)

// DFLT1DR Configuration

