hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mdf.h
#define	MDF_DLY2CR_SKPBF_B_0X0			(0x0u<<31)
#define	MDF_DLY2CR_SKPBF_B_0X1			(0x1u<<31)
#define	MDF_DLY2CR_SKPDLY_B_0X0			(0x0u<<0)
#define	MDF_DLY2CR_SKPDLY_B_0X1			(0x1u<<0)

// SCD2CR Configuration

#define	MDF_SCD2CR_SCDACTIVE			(0x1u<<31)
#define	MDF_SCD2CR_SCDT					(0xFFu<<12)
#define	MDF_SCD2CR_SCDT_0				(0x1u<<12)
#define	MDF_SCD2CR_BKSCD				(0xFu<<4)
#define	MDF_SCD2CR_BKSCD_0				(0x1u<<4)
#define	MDF_SCD2CR_SCDEN				(0x1u<<0)

#define	MDF_SCD2CR_SCDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_SCD2CR_SCDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_SCD2CR_SCDT_B_0X0			(0x0u<<12)
#define	MDF_SCD2CR_SCDT_B_0X1			(0x1u<<12)
#define	MDF_SCD2CR_SCDEN_B_0X0			(0x0u<<0)
#define	MDF_SCD2CR_SCDEN_B_0X1			(0x1u<<0)

// DFLT2IER Configuration

#define	MDF_DFLT2IER_RFOVRIE			(0x1u<<11)
#define	MDF_DFLT2IER_CKABIE				(0x1u<<10)
#define	MDF_DFLT2IER_SATIE				(0x1u<<9)
#define	MDF_DFLT2IER_SCDIE				(0x1u<<8)
#define	MDF_DFLT2IER_SSOVRIE			(0x1u<<7)
#define	MDF_DFLT2IER_OLDIE				(0x1u<<4)
#define	MDF_DFLT2IER_SSDRIE				(0x1u<<2)
#define	MDF_DFLT2IER_DOVRIE				(0x1u<<1)
#define	MDF_DFLT2IER_FTHIE				(0x1u<<0)

#define	MDF_DFLT2IER_RFOVRIE_B_0X0		(0x0u<<11)
#define	MDF_DFLT2IER_RFOVRIE_B_0X1		(0x1u<<11)
#define	MDF_DFLT2IER_CKABIE_B_0X0		(0x0u<<10)
#define	MDF_DFLT2IER_CKABIE_B_0X1		(0x1u<<10)
#define	MDF_DFLT2IER_SATIE_B_0X0		(0x0u<<9)
#define	MDF_DFLT2IER_SATIE_B_0X1		(0x1u<<9)
#define	MDF_DFLT2IER_SCDIE_B_0X0		(0x0u<<8)
#define	MDF_DFLT2IER_SCDIE_B_0X1		(0x1u<<8)
#define	MDF_DFLT2IER_SSOVRIE_B_0X0		(0x0u<<7)
#define	MDF_DFLT2IER_SSOVRIE_B_0X1		(0x1u<<7)
#define	MDF_DFLT2IER_OLDIE_B_0X0		(0x0u<<4)
#define	MDF_DFLT2IER_OLDIE_B_0X1		(0x1u<<4)
#define	MDF_DFLT2IER_SSDRIE_B_0X0		(0x0u<<2)
#define	MDF_DFLT2IER_SSDRIE_B_0X1		(0x1u<<2)
#define	MDF_DFLT2IER_DOVRIE_B_0X0		(0x0u<<1)
#define	MDF_DFLT2IER_DOVRIE_B_0X1		(0x1u<<1)
#define	MDF_DFLT2IER_FTHIE_B_0X0		(0x0u<<0)
#define	MDF_DFLT2IER_FTHIE_B_0X1		(0x1u<<0)

// DFLT2ISR Configuration

#define	MDF_DFLT2ISR_RFOVRF				(0x1u<<11)
#define	MDF_DFLT2ISR_CKABF				(0x1u<<10)
#define	MDF_DFLT2ISR_SATF				(0x1u<<9)
#define	MDF_DFLT2ISR_SCDF				(0x1u<<8)
#define	MDF_DFLT2ISR_SSOVRF				(0x1u<<7)
#define	MDF_DFLT2ISR_THHF				(0x1u<<6)
#define	MDF_DFLT2ISR_THLF				(0x1u<<5)
#define	MDF_DFLT2ISR_OLDF				(0x1u<<4)
#define	MDF_DFLT2ISR_RXNEF				(0x1u<<3)
#define	MDF_DFLT2ISR_SSDRF				(0x1u<<2)
#define	MDF_DFLT2ISR_DOVRF				(0x1u<<1)
#define	MDF_DFLT2ISR_FTHF				(0x1u<<0)

#define	MDF_DFLT2ISR_RFOVRF_B_0X0		(0x0u<<11)
#define	MDF_DFLT2ISR_RFOVRF_B_0X1		(0x1u<<11)
#define	MDF_DFLT2ISR_CKABF_B_0X0		(0x0u<<10)
#define	MDF_DFLT2ISR_CKABF_B_0X1		(0x1u<<10)
#define	MDF_DFLT2ISR_SATF_B_0X0			(0x0u<<9)
#define	MDF_DFLT2ISR_SATF_B_0X1			(0x1u<<9)
#define	MDF_DFLT2ISR_SCDF_B_0X0			(0x0u<<8)
#define	MDF_DFLT2ISR_SCDF_B_0X1			(0x1u<<8)
#define	MDF_DFLT2ISR_SSOVRF_B_0X0		(0x0u<<7)
#define	MDF_DFLT2ISR_SSOVRF_B_0X1		(0x1u<<7)
#define	MDF_DFLT2ISR_THHF_B_0X0			(0x0u<<6)
#define	MDF_DFLT2ISR_THHF_B_0X1			(0x1u<<6)
#define	MDF_DFLT2ISR_THLF_B_0X0			(0x0u<<5)
#define	MDF_DFLT2ISR_THLF_B_0X1			(0x1u<<5)
#define	MDF_DFLT2ISR_OLDF_B_0X0			(0x0u<<4)
#define	MDF_DFLT2ISR_OLDF_B_0X1			(0x1u<<4)
#define	MDF_DFLT2ISR_RXNEF_B_0X0		(0x0u<<3)
#define	MDF_DFLT2ISR_RXNEF_B_0X1		(0x1u<<3)
#define	MDF_DFLT2ISR_SSDRF_B_0X0		(0x0u<<2)
#define	MDF_DFLT2ISR_SSDRF_B_0X1		(0x1u<<2)
#define	MDF_DFLT2ISR_DOVRF_B_0X0		(0x0u<<1)
#define	MDF_DFLT2ISR_DOVRF_B_0X1		(0x1u<<1)
#define	MDF_DFLT2ISR_FTHF_B_0X0			(0x0u<<0)
#define	MDF_DFLT2ISR_FTHF_B_0X1			(0x1u<<0)

// OEC2CR Configuration

#define	MDF_OEC2CR_OFFSET				(0x3FFFFFFu<<0)
#define	MDF_OEC2CR_OFFSET_0				(0x1u<<0)

// SNPS2DR Configuration

#define	MDF_SNPS2DR_SDR					(0xFFFFu<<16)
#define	MDF_SNPS2DR_SDR_0				(0x1u<<16)
#define	MDF_SNPS2DR_EXTSDR				(0x7Fu<<9)
#define	MDF_SNPS2DR_EXTSDR_0			(0x1u<<9)
#define	MDF_SNPS2DR_MCICDC				(0x1FFu<<0)
#define	MDF_SNPS2DR_MCICDC_0			(0x1u<<0)

// DFLT2DR Configuration

#define	MDF_DFLT2DR_DR					(0xFFFFFFu<<8)
#define	MDF_DFLT2DR_DR_0				(0x1u<<8)

// SITF3CR Configuration

#define	MDF_SITF3CR_SITFACTIVE			(0x1u<<31)
#define	MDF_SITF3CR_STH					(0x1Fu<<8)
#define	MDF_SITF3CR_STH_0				(0x1u<<8)
#define	MDF_SITF3CR_SITFMOD				(0x3u<<4)
#define	MDF_SITF3CR_SITFMOD_0			(0x1u<<4)
#define	MDF_SITF3CR_SCKSRC				(0x3u<<1)
#define	MDF_SITF3CR_SCKSRC_0			(0x1u<<1)
#define	MDF_SITF3CR_SITFEN				(0x1u<<0)

#define	MDF_SITF3CR_SITFACTIVE_B_0X0	(0x0u<<31)
#define	MDF_SITF3CR_SITFACTIVE_B_0X1	(0x1u<<31)
#define	MDF_SITF3CR_SITFMOD_B_0X0		(0x0u<<4)
#define	MDF_SITF3CR_SITFMOD_B_0X1		(0x1u<<4)
#define	MDF_SITF3CR_SITFMOD_B_0X2		(0x2u<<4)
#define	MDF_SITF3CR_SITFMOD_B_0X3		(0x3u<<4)
#define	MDF_SITF3CR_SCKSRC_B_0X0		(0x0u<<1)
#define	MDF_SITF3CR_SCKSRC_B_0X1		(0x1u<<1)
#define	MDF_SITF3CR_SITFEN_B_0X0		(0x0u<<0)
#define	MDF_SITF3CR_SITFEN_B_0X1		(0x1u<<0)

// BSMX3CR Configuration

#define	MDF_BSMX3CR_BSMXACTIVE			(0x1u<<31)
#define	MDF_BSMX3CR_BSSEL				(0x1Fu<<0)
#define	MDF_BSMX3CR_BSSEL_0				(0x1u<<0)

#define	MDF_BSMX3CR_BSMXACTIVE_B_0X0	(0x0u<<31)
#define	MDF_BSMX3CR_BSMXACTIVE_B_0X1	(0x1u<<31)
#define	MDF_BSMX3CR_BSSEL_B_0X0			(0x0u<<0)
#define	MDF_BSMX3CR_BSSEL_B_0X1			(0x1u<<0)
#define	MDF_BSMX3CR_BSSEL_B_0X2			(0x2u<<0)
#define	MDF_BSMX3CR_BSSEL_B_0X3			(0x3u<<0)
#define	MDF_BSMX3CR_BSSEL_B_0X1E		(0x1Eu<<0)
#define	MDF_BSMX3CR_BSSEL_B_0X1F		(0x1Fu<<0)

// DFLT3CR Configuration

#define	MDF_DFLT3CR_DFLTACTIVE			(0x1u<<31)
#define	MDF_DFLT3CR_DFLTRUN				(0x1u<<30)
#define	MDF_DFLT3CR_NBDIS				(0xFFu<<20)
#define	MDF_DFLT3CR_NBDIS_0				(0x1u<<20)
#define	MDF_DFLT3CR_SNPSFMT				(0x1u<<16)
#define	MDF_DFLT3CR_TRGSRC				(0xFu<<12)
#define	MDF_DFLT3CR_TRGSRC_0			(0x1u<<12)
#define	MDF_DFLT3CR_TRGSENS				(0x1u<<8)
#define	MDF_DFLT3CR_ACQMOD				(0x7u<<4)
#define	MDF_DFLT3CR_ACQMOD_0			(0x1u<<4)
#define	MDF_DFLT3CR_FTH					(0x1u<<2)
#define	MDF_DFLT3CR_DMAEN				(0x1u<<1)
#define	MDF_DFLT3CR_DFLTEN				(0x1u<<0)

#define	MDF_DFLT3CR_DFLTACTIVE_B_0X0	(0x0u<<31)
#define	MDF_DFLT3CR_DFLTACTIVE_B_0X1	(0x1u<<31)
#define	MDF_DFLT3CR_DFLTRUN_B_0X0		(0x0u<<30)
#define	MDF_DFLT3CR_DFLTRUN_B_0X1		(0x1u<<30)
#define	MDF_DFLT3CR_NBDIS_B_0X0			(0x0u<<20)
#define	MDF_DFLT3CR_NBDIS_B_0X1			(0x1u<<20)
#define	MDF_DFLT3CR_SNPSFMT_B_0X0		(0x0u<<16)
#define	MDF_DFLT3CR_SNPSFMT_B_0X1		(0x1u<<16)
#define	MDF_DFLT3CR_TRGSRC_B_0X0		(0x0u<<12)
#define	MDF_DFLT3CR_TRGSRC_B_0X1		(0x1u<<12)
#define	MDF_DFLT3CR_TRGSRC_B_0X2		(0x2u<<12)
#define	MDF_DFLT3CR_TRGSRC_B_0XF		(0xFu<<12)
#define	MDF_DFLT3CR_TRGSENS_B_0X0		(0x0u<<8)
#define	MDF_DFLT3CR_TRGSENS_B_0X1		(0x1u<<8)
#define	MDF_DFLT3CR_ACQMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT3CR_ACQMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT3CR_ACQMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT3CR_ACQMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT3CR_ACQMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT3CR_ACQMOD_B_0X5		(0x5u<<4)
#define	MDF_DFLT3CR_FTH_B_0X0			(0x0u<<2)
#define	MDF_DFLT3CR_FTH_B_0X1			(0x1u<<2)
#define	MDF_DFLT3CR_DMAEN_B_0X0			(0x0u<<1)
#define	MDF_DFLT3CR_DMAEN_B_0X1			(0x1u<<1)
#define	MDF_DFLT3CR_DFLTEN_B_0X0		(0x0u<<0)
#define	MDF_DFLT3CR_DFLTEN_B_0X1		(0x1u<<0)

// DFLT3CICR Configuration

#define	MDF_DFLT3CICR_SCALE				(0x3Fu<<20)
#define	MDF_DFLT3CICR_SCALE_0			(0x1u<<20)
#define	MDF_DFLT3CICR_MCICD8			(0x1u<<16)
#define	MDF_DFLT3CICR_MCICD				(0xFFu<<8)
#define	MDF_DFLT3CICR_MCICD_0			(0x1u<<8)
#define	MDF_DFLT3CICR_CICMOD			(0x7u<<4)
#define	MDF_DFLT3CICR_CICMOD_0			(0x1u<<4)
#define	MDF_DFLT3CICR_DATSRC			(0x3u<<0)
#define	MDF_DFLT3CICR_DATSRC_0			(0x1u<<0)

#define	MDF_DFLT3CICR_SCALE_B_0X0		(0x0u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X1		(0x1u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X2		(0x2u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X18		(0x18u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X20		(0x20u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X21		(0x21u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X22		(0x22u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X23		(0x23u<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X2E		(0x2Eu<<20)
#define	MDF_DFLT3CICR_SCALE_B_0X2F		(0x2Fu<<20)
#define	MDF_DFLT3CICR_MCICD8_B_0X0		(0x0u<<16)
#define	MDF_DFLT3CICR_MCICD8_B_0X1		(0x1u<<16)
#define	MDF_DFLT3CICR_MCICD_B_0X0		(0x0u<<8)
#define	MDF_DFLT3CICR_MCICD_B_0X1		(0x1u<<8)
#define	MDF_DFLT3CICR_CICMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT3CICR_CICMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT3CICR_CICMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT3CICR_CICMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT3CICR_CICMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT3CICR_DATSRC_B_0X2		(0x2u<<0)
#define	MDF_DFLT3CICR_DATSRC_B_0X3		(0x3u<<0)

// DFLT3RSFR Configuration

