hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mdf.h
#define	MDF_SNPS3DR_SDR					(0xFFFFu<<16)
#define	MDF_SNPS3DR_SDR_0				(0x1u<<16)
#define	MDF_SNPS3DR_EXTSDR				(0x7Fu<<9)
#define	MDF_SNPS3DR_EXTSDR_0			(0x1u<<9)
#define	MDF_SNPS3DR_MCICDC				(0x1FFu<<0)
#define	MDF_SNPS3DR_MCICDC_0			(0x1u<<0)

// DFLT3DR Configuration

#define	MDF_DFLT3DR_DR					(0xFFFFFFu<<8)
#define	MDF_DFLT3DR_DR_0				(0x1u<<8)

// SITF4CR Configuration

#define	MDF_SITF4CR_SITFACTIVE			(0x1u<<31)
#define	MDF_SITF4CR_STH					(0x1Fu<<8)
#define	MDF_SITF4CR_STH_0				(0x1u<<8)
#define	MDF_SITF4CR_SITFMOD				(0x3u<<4)
#define	MDF_SITF4CR_SITFMOD_0			(0x1u<<4)
#define	MDF_SITF4CR_SCKSRC				(0x3u<<1)
#define	MDF_SITF4CR_SCKSRC_0			(0x1u<<1)
#define	MDF_SITF4CR_SITFEN				(0x1u<<0)

#define	MDF_SITF4CR_SITFACTIVE_B_0X0	(0x0u<<31)
#define	MDF_SITF4CR_SITFACTIVE_B_0X1	(0x1u<<31)
#define	MDF_SITF4CR_SITFMOD_B_0X0		(0x0u<<4)
#define	MDF_SITF4CR_SITFMOD_B_0X1		(0x1u<<4)
#define	MDF_SITF4CR_SITFMOD_B_0X2		(0x2u<<4)
#define	MDF_SITF4CR_SITFMOD_B_0X3		(0x3u<<4)
#define	MDF_SITF4CR_SCKSRC_B_0X0		(0x0u<<1)
#define	MDF_SITF4CR_SCKSRC_B_0X1		(0x1u<<1)
#define	MDF_SITF4CR_SITFEN_B_0X0		(0x0u<<0)
#define	MDF_SITF4CR_SITFEN_B_0X1		(0x1u<<0)

// BSMX4CR Configuration

#define	MDF_BSMX4CR_BSMXACTIVE			(0x1u<<31)
#define	MDF_BSMX4CR_BSSEL				(0x1Fu<<0)
#define	MDF_BSMX4CR_BSSEL_0				(0x1u<<0)

#define	MDF_BSMX4CR_BSMXACTIVE_B_0X0	(0x0u<<31)
#define	MDF_BSMX4CR_BSMXACTIVE_B_0X1	(0x1u<<31)
#define	MDF_BSMX4CR_BSSEL_B_0X0			(0x0u<<0)
#define	MDF_BSMX4CR_BSSEL_B_0X1			(0x1u<<0)
#define	MDF_BSMX4CR_BSSEL_B_0X2			(0x2u<<0)
#define	MDF_BSMX4CR_BSSEL_B_0X3			(0x3u<<0)
#define	MDF_BSMX4CR_BSSEL_B_0X1E		(0x1Eu<<0)
#define	MDF_BSMX4CR_BSSEL_B_0X1F		(0x1Fu<<0)

// DFLT4CR Configuration

#define	MDF_DFLT4CR_DFLTACTIVE			(0x1u<<31)
#define	MDF_DFLT4CR_DFLTRUN				(0x1u<<30)
#define	MDF_DFLT4CR_NBDIS				(0xFFu<<20)
#define	MDF_DFLT4CR_NBDIS_0				(0x1u<<20)
#define	MDF_DFLT4CR_SNPSFMT				(0x1u<<16)
#define	MDF_DFLT4CR_TRGSRC				(0xFu<<12)
#define	MDF_DFLT4CR_TRGSRC_0			(0x1u<<12)
#define	MDF_DFLT4CR_TRGSENS				(0x1u<<8)
#define	MDF_DFLT4CR_ACQMOD				(0x7u<<4)
#define	MDF_DFLT4CR_ACQMOD_0			(0x1u<<4)
#define	MDF_DFLT4CR_FTH					(0x1u<<2)
#define	MDF_DFLT4CR_DMAEN				(0x1u<<1)
#define	MDF_DFLT4CR_DFLTEN				(0x1u<<0)

#define	MDF_DFLT4CR_DFLTACTIVE_B_0X0	(0x0u<<31)
#define	MDF_DFLT4CR_DFLTACTIVE_B_0X1	(0x1u<<31)
#define	MDF_DFLT4CR_DFLTRUN_B_0X0		(0x0u<<30)
#define	MDF_DFLT4CR_DFLTRUN_B_0X1		(0x1u<<30)
#define	MDF_DFLT4CR_NBDIS_B_0X0			(0x0u<<20)
#define	MDF_DFLT4CR_NBDIS_B_0X1			(0x1u<<20)
#define	MDF_DFLT4CR_SNPSFMT_B_0X0		(0x0u<<16)
#define	MDF_DFLT4CR_SNPSFMT_B_0X1		(0x1u<<16)
#define	MDF_DFLT4CR_TRGSRC_B_0X0		(0x0u<<12)
#define	MDF_DFLT4CR_TRGSRC_B_0X1		(0x1u<<12)
#define	MDF_DFLT4CR_TRGSRC_B_0X2		(0x2u<<12)
#define	MDF_DFLT4CR_TRGSRC_B_0XF		(0xFu<<12)
#define	MDF_DFLT4CR_TRGSENS_B_0X0		(0x0u<<8)
#define	MDF_DFLT4CR_TRGSENS_B_0X1		(0x1u<<8)
#define	MDF_DFLT4CR_ACQMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT4CR_ACQMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT4CR_ACQMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT4CR_ACQMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT4CR_ACQMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT4CR_ACQMOD_B_0X5		(0x5u<<4)
#define	MDF_DFLT4CR_FTH_B_0X0			(0x0u<<2)
#define	MDF_DFLT4CR_FTH_B_0X1			(0x1u<<2)
#define	MDF_DFLT4CR_DMAEN_B_0X0			(0x0u<<1)
#define	MDF_DFLT4CR_DMAEN_B_0X1			(0x1u<<1)
#define	MDF_DFLT4CR_DFLTEN_B_0X0		(0x0u<<0)
#define	MDF_DFLT4CR_DFLTEN_B_0X1		(0x1u<<0)

// DFLT4CICR Configuration

#define	MDF_DFLT4CICR_SCALE				(0x3Fu<<20)
#define	MDF_DFLT4CICR_SCALE_0			(0x1u<<20)
#define	MDF_DFLT4CICR_MCICD8			(0x1u<<16)
#define	MDF_DFLT4CICR_MCICD				(0xFFu<<8)
#define	MDF_DFLT4CICR_MCICD_0			(0x1u<<8)
#define	MDF_DFLT4CICR_CICMOD			(0x7u<<4)
#define	MDF_DFLT4CICR_CICMOD_0			(0x1u<<4)
#define	MDF_DFLT4CICR_DATSRC			(0x3u<<0)
#define	MDF_DFLT4CICR_DATSRC_0			(0x1u<<0)

#define	MDF_DFLT4CICR_SCALE_B_0X0		(0x0u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X1		(0x1u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X2		(0x2u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X18		(0x18u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X20		(0x20u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X21		(0x21u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X22		(0x22u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X23		(0x23u<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X2E		(0x2Eu<<20)
#define	MDF_DFLT4CICR_SCALE_B_0X2F		(0x2Fu<<20)
#define	MDF_DFLT4CICR_MCICD8_B_0X0		(0x0u<<16)
#define	MDF_DFLT4CICR_MCICD8_B_0X1		(0x1u<<16)
#define	MDF_DFLT4CICR_MCICD_B_0X0		(0x0u<<8)
#define	MDF_DFLT4CICR_MCICD_B_0X1		(0x1u<<8)
#define	MDF_DFLT4CICR_CICMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT4CICR_CICMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT4CICR_CICMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT4CICR_CICMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT4CICR_CICMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT4CICR_DATSRC_B_0X2		(0x2u<<0)
#define	MDF_DFLT4CICR_DATSRC_B_0X3		(0x3u<<0)

// DFLT4RSFR Configuration

#define	MDF_DFLT4RSFR_HPFC				(0x3u<<8)
#define	MDF_DFLT4RSFR_HPFC_0			(0x1u<<8)
#define	MDF_DFLT4RSFR_HPFBYP			(0x1u<<7)
#define	MDF_DFLT4RSFR_RSFLTD			(0x1u<<4)
#define	MDF_DFLT4RSFR_RSFLTBYP			(0x1u<<0)

#define	MDF_DFLT4RSFR_HPFC_B_0X0		(0x0u<<8)
#define	MDF_DFLT4RSFR_HPFC_B_0X1		(0x1u<<8)
#define	MDF_DFLT4RSFR_HPFC_B_0X2		(0x2u<<8)
#define	MDF_DFLT4RSFR_HPFC_B_0X3		(0x3u<<8)
#define	MDF_DFLT4RSFR_HPFBYP_B_0X0		(0x0u<<7)
#define	MDF_DFLT4RSFR_HPFBYP_B_0X1		(0x1u<<7)
#define	MDF_DFLT4RSFR_RSFLTD_B_0X0		(0x0u<<4)
#define	MDF_DFLT4RSFR_RSFLTD_B_0X1		(0x1u<<4)
#define	MDF_DFLT4RSFR_RSFLTBYP_B_0X0	(0x0u<<0)
#define	MDF_DFLT4RSFR_RSFLTBYP_B_0X1	(0x1u<<0)

// DFLT4INTR Configuration

#define	MDF_DFLT4INTR_INTVAL			(0x7Fu<<4)
#define	MDF_DFLT4INTR_INTVAL_0			(0x1u<<4)
#define	MDF_DFLT4INTR_INTDIV			(0x3u<<0)
#define	MDF_DFLT4INTR_INTDIV_0			(0x1u<<0)

#define	MDF_DFLT4INTR_INTVAL_B_0X0		(0x0u<<4)
#define	MDF_DFLT4INTR_INTVAL_B_0X1		(0x1u<<4)
#define	MDF_DFLT4INTR_INTDIV_B_0X0		(0x0u<<0)
#define	MDF_DFLT4INTR_INTDIV_B_0X1		(0x1u<<0)
#define	MDF_DFLT4INTR_INTDIV_B_0X2		(0x2u<<0)
#define	MDF_DFLT4INTR_INTDIV_B_0X3		(0x3u<<0)

// OLD4CR Configuration

#define	MDF_OLD4CR_OLDACTIVE			(0x1u<<31)
#define	MDF_OLD4CR_ACICD				(0x1Fu<<17)
#define	MDF_OLD4CR_ACICD_0				(0x1u<<17)
#define	MDF_OLD4CR_ACICN				(0x3u<<12)
#define	MDF_OLD4CR_ACICN_0				(0x1u<<12)
#define	MDF_OLD4CR_BKOLD				(0xFu<<4)
#define	MDF_OLD4CR_BKOLD_0				(0x1u<<4)
#define	MDF_OLD4CR_THINB				(0x1u<<1)
#define	MDF_OLD4CR_OLDEN				(0x1u<<0)

#define	MDF_OLD4CR_OLDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_OLD4CR_OLDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_OLD4CR_ACICD_B_0X0			(0x0u<<17)
#define	MDF_OLD4CR_ACICD_B_0X1			(0x1u<<17)
#define	MDF_OLD4CR_ACICN_B_0X0			(0x0u<<12)
#define	MDF_OLD4CR_ACICN_B_0X1			(0x1u<<12)
#define	MDF_OLD4CR_ACICN_B_0X2			(0x2u<<12)
#define	MDF_OLD4CR_ACICN_B_0X3			(0x3u<<12)
#define	MDF_OLD4CR_THINB_B_0X0			(0x0u<<1)
#define	MDF_OLD4CR_THINB_B_0X1			(0x1u<<1)
#define	MDF_OLD4CR_OLDEN_B_0X0			(0x0u<<0)
#define	MDF_OLD4CR_OLDEN_B_0X1			(0x1u<<0)

// OLD4THLR Configuration

#define	MDF_OLD4THLR_OLDTHL				(0x3FFFFFFu<<0)
#define	MDF_OLD4THLR_OLDTHL_0			(0x1u<<0)

// OLD4THHR Configuration

