hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_mdf.h
#define	MDF_DFLT5CR_DFLTACTIVE_B_0X0	(0x0u<<31)
#define	MDF_DFLT5CR_DFLTACTIVE_B_0X1	(0x1u<<31)
#define	MDF_DFLT5CR_DFLTRUN_B_0X0		(0x0u<<30)
#define	MDF_DFLT5CR_DFLTRUN_B_0X1		(0x1u<<30)
#define	MDF_DFLT5CR_NBDIS_B_0X0			(0x0u<<20)
#define	MDF_DFLT5CR_NBDIS_B_0X1			(0x1u<<20)
#define	MDF_DFLT5CR_SNPSFMT_B_0X0		(0x0u<<16)
#define	MDF_DFLT5CR_SNPSFMT_B_0X1		(0x1u<<16)
#define	MDF_DFLT5CR_TRGSRC_B_0X0		(0x0u<<12)
#define	MDF_DFLT5CR_TRGSRC_B_0X1		(0x1u<<12)
#define	MDF_DFLT5CR_TRGSRC_B_0X2		(0x2u<<12)
#define	MDF_DFLT5CR_TRGSRC_B_0XF		(0xFu<<12)
#define	MDF_DFLT5CR_TRGSENS_B_0X0		(0x0u<<8)
#define	MDF_DFLT5CR_TRGSENS_B_0X1		(0x1u<<8)
#define	MDF_DFLT5CR_ACQMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT5CR_ACQMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT5CR_ACQMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT5CR_ACQMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT5CR_ACQMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT5CR_ACQMOD_B_0X5		(0x5u<<4)
#define	MDF_DFLT5CR_FTH_B_0X0			(0x0u<<2)
#define	MDF_DFLT5CR_FTH_B_0X1			(0x1u<<2)
#define	MDF_DFLT5CR_DMAEN_B_0X0			(0x0u<<1)
#define	MDF_DFLT5CR_DMAEN_B_0X1			(0x1u<<1)
#define	MDF_DFLT5CR_DFLTEN_B_0X0		(0x0u<<0)
#define	MDF_DFLT5CR_DFLTEN_B_0X1		(0x1u<<0)

// DFLT5CICR Configuration

#define	MDF_DFLT5CICR_SCALE				(0x3Fu<<20)
#define	MDF_DFLT5CICR_SCALE_0			(0x1u<<20)
#define	MDF_DFLT5CICR_MCICD8			(0x1u<<16)
#define	MDF_DFLT5CICR_MCICD				(0xFFu<<8)
#define	MDF_DFLT5CICR_MCICD_0			(0x1u<<8)
#define	MDF_DFLT5CICR_CICMOD			(0x7u<<4)
#define	MDF_DFLT5CICR_CICMOD_0			(0x1u<<4)
#define	MDF_DFLT5CICR_DATSRC			(0x3u<<0)
#define	MDF_DFLT5CICR_DATSRC_0			(0x1u<<0)

#define	MDF_DFLT5CICR_SCALE_B_0X0		(0x0u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X1		(0x1u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X2		(0x2u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X18		(0x18u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X20		(0x20u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X21		(0x21u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X22		(0x22u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X23		(0x23u<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X2E		(0x2Eu<<20)
#define	MDF_DFLT5CICR_SCALE_B_0X2F		(0x2Fu<<20)
#define	MDF_DFLT5CICR_MCICD8_B_0X0		(0x0u<<16)
#define	MDF_DFLT5CICR_MCICD8_B_0X1		(0x1u<<16)
#define	MDF_DFLT5CICR_MCICD_B_0X0		(0x0u<<8)
#define	MDF_DFLT5CICR_MCICD_B_0X1		(0x1u<<8)
#define	MDF_DFLT5CICR_CICMOD_B_0X0		(0x0u<<4)
#define	MDF_DFLT5CICR_CICMOD_B_0X1		(0x1u<<4)
#define	MDF_DFLT5CICR_CICMOD_B_0X2		(0x2u<<4)
#define	MDF_DFLT5CICR_CICMOD_B_0X3		(0x3u<<4)
#define	MDF_DFLT5CICR_CICMOD_B_0X4		(0x4u<<4)
#define	MDF_DFLT5CICR_DATSRC_B_0X2		(0x2u<<0)
#define	MDF_DFLT5CICR_DATSRC_B_0X3		(0x3u<<0)

// DFLT5RSFR Configuration

#define	MDF_DFLT5RSFR_HPFC				(0x3u<<8)
#define	MDF_DFLT5RSFR_HPFC_0			(0x1u<<8)
#define	MDF_DFLT5RSFR_HPFBYP			(0x1u<<7)
#define	MDF_DFLT5RSFR_RSFLTD			(0x1u<<4)
#define	MDF_DFLT5RSFR_RSFLTBYP			(0x1u<<0)

#define	MDF_DFLT5RSFR_HPFC_B_0X0		(0x0u<<8)
#define	MDF_DFLT5RSFR_HPFC_B_0X1		(0x1u<<8)
#define	MDF_DFLT5RSFR_HPFC_B_0X2		(0x2u<<8)
#define	MDF_DFLT5RSFR_HPFC_B_0X3		(0x3u<<8)
#define	MDF_DFLT5RSFR_HPFBYP_B_0X0		(0x0u<<7)
#define	MDF_DFLT5RSFR_HPFBYP_B_0X1		(0x1u<<7)
#define	MDF_DFLT5RSFR_RSFLTD_B_0X0		(0x0u<<4)
#define	MDF_DFLT5RSFR_RSFLTD_B_0X1		(0x1u<<4)
#define	MDF_DFLT5RSFR_RSFLTBYP_B_0X0	(0x0u<<0)
#define	MDF_DFLT5RSFR_RSFLTBYP_B_0X1	(0x1u<<0)

// DFLT5INTR Configuration

#define	MDF_DFLT5INTR_INTVAL			(0x7Fu<<4)
#define	MDF_DFLT5INTR_INTVAL_0			(0x1u<<4)
#define	MDF_DFLT5INTR_INTDIV			(0x3u<<0)
#define	MDF_DFLT5INTR_INTDIV_0			(0x1u<<0)

#define	MDF_DFLT5INTR_INTVAL_B_0X0		(0x0u<<4)
#define	MDF_DFLT5INTR_INTVAL_B_0X1		(0x1u<<4)
#define	MDF_DFLT5INTR_INTDIV_B_0X0		(0x0u<<0)
#define	MDF_DFLT5INTR_INTDIV_B_0X1		(0x1u<<0)
#define	MDF_DFLT5INTR_INTDIV_B_0X2		(0x2u<<0)
#define	MDF_DFLT5INTR_INTDIV_B_0X3		(0x3u<<0)

// OLD5CR Configuration

#define	MDF_OLD5CR_OLDACTIVE			(0x1u<<31)
#define	MDF_OLD5CR_ACICD				(0x1Fu<<17)
#define	MDF_OLD5CR_ACICD_0				(0x1u<<17)
#define	MDF_OLD5CR_ACICN				(0x3u<<12)
#define	MDF_OLD5CR_ACICN_0				(0x1u<<12)
#define	MDF_OLD5CR_BKOLD				(0xFu<<4)
#define	MDF_OLD5CR_BKOLD_0				(0x1u<<4)
#define	MDF_OLD5CR_THINB				(0x1u<<1)
#define	MDF_OLD5CR_OLDEN				(0x1u<<0)

#define	MDF_OLD5CR_OLDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_OLD5CR_OLDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_OLD5CR_ACICD_B_0X0			(0x0u<<17)
#define	MDF_OLD5CR_ACICD_B_0X1			(0x1u<<17)
#define	MDF_OLD5CR_ACICN_B_0X0			(0x0u<<12)
#define	MDF_OLD5CR_ACICN_B_0X1			(0x1u<<12)
#define	MDF_OLD5CR_ACICN_B_0X2			(0x2u<<12)
#define	MDF_OLD5CR_ACICN_B_0X3			(0x3u<<12)
#define	MDF_OLD5CR_THINB_B_0X0			(0x0u<<1)
#define	MDF_OLD5CR_THINB_B_0X1			(0x1u<<1)
#define	MDF_OLD5CR_OLDEN_B_0X0			(0x0u<<0)
#define	MDF_OLD5CR_OLDEN_B_0X1			(0x1u<<0)

// OLD5THLR Configuration

#define	MDF_OLD5THLR_OLDTHL				(0x3FFFFFFu<<0)
#define	MDF_OLD5THLR_OLDTHL_0			(0x1u<<0)

// OLD5THHR Configuration

#define	MDF_OLD5THHR_OLDTHH				(0x3FFFFFFu<<0)
#define	MDF_OLD5THHR_OLDTHH_0			(0x1u<<0)

// DLY5CR Configuration

#define	MDF_DLY5CR_SKPBF				(0x1u<<31)
#define	MDF_DLY5CR_SKPDLY				(0x7Fu<<0)
#define	MDF_DLY5CR_SKPDLY_0				(0x1u<<0)

#define	MDF_DLY5CR_SKPBF_B_0X0			(0x0u<<31)
#define	MDF_DLY5CR_SKPBF_B_0X1			(0x1u<<31)
#define	MDF_DLY5CR_SKPDLY_B_0X0			(0x0u<<0)
#define	MDF_DLY5CR_SKPDLY_B_0X1			(0x1u<<0)

// SCD5CR Configuration

#define	MDF_SCD5CR_SCDACTIVE			(0x1u<<31)
#define	MDF_SCD5CR_SCDT					(0xFFu<<12)
#define	MDF_SCD5CR_SCDT_0				(0x1u<<12)
#define	MDF_SCD5CR_BKSCD				(0xFu<<4)
#define	MDF_SCD5CR_BKSCD_0				(0x1u<<4)
#define	MDF_SCD5CR_SCDEN				(0x1u<<0)

#define	MDF_SCD5CR_SCDACTIVE_B_0X0		(0x0u<<31)
#define	MDF_SCD5CR_SCDACTIVE_B_0X1		(0x1u<<31)
#define	MDF_SCD5CR_SCDT_B_0X0			(0x0u<<12)
#define	MDF_SCD5CR_SCDT_B_0X1			(0x1u<<12)
#define	MDF_SCD5CR_SCDEN_B_0X0			(0x0u<<0)
#define	MDF_SCD5CR_SCDEN_B_0X1			(0x1u<<0)

// DFLT5IER Configuration

#define	MDF_DFLT5IER_RFOVRIE			(0x1u<<11)
#define	MDF_DFLT5IER_CKABIE				(0x1u<<10)
#define	MDF_DFLT5IER_SATIE				(0x1u<<9)
#define	MDF_DFLT5IER_SCDIE				(0x1u<<8)
#define	MDF_DFLT5IER_SSOVRIE			(0x1u<<7)
#define	MDF_DFLT5IER_OLDIE				(0x1u<<4)
#define	MDF_DFLT5IER_SSDRIE				(0x1u<<2)
#define	MDF_DFLT5IER_DOVRIE				(0x1u<<1)
#define	MDF_DFLT5IER_FTHIE				(0x1u<<0)

#define	MDF_DFLT5IER_RFOVRIE_B_0X0		(0x0u<<11)
#define	MDF_DFLT5IER_RFOVRIE_B_0X1		(0x1u<<11)
#define	MDF_DFLT5IER_CKABIE_B_0X0		(0x0u<<10)
#define	MDF_DFLT5IER_CKABIE_B_0X1		(0x1u<<10)
#define	MDF_DFLT5IER_SATIE_B_0X0		(0x0u<<9)
#define	MDF_DFLT5IER_SATIE_B_0X1		(0x1u<<9)
#define	MDF_DFLT5IER_SCDIE_B_0X0		(0x0u<<8)
#define	MDF_DFLT5IER_SCDIE_B_0X1		(0x1u<<8)
#define	MDF_DFLT5IER_SSOVRIE_B_0X0		(0x0u<<7)
#define	MDF_DFLT5IER_SSOVRIE_B_0X1		(0x1u<<7)
#define	MDF_DFLT5IER_OLDIE_B_0X0		(0x0u<<4)
#define	MDF_DFLT5IER_OLDIE_B_0X1		(0x1u<<4)
#define	MDF_DFLT5IER_SSDRIE_B_0X0		(0x0u<<2)
#define	MDF_DFLT5IER_SSDRIE_B_0X1		(0x1u<<2)
#define	MDF_DFLT5IER_DOVRIE_B_0X0		(0x0u<<1)
#define	MDF_DFLT5IER_DOVRIE_B_0X1		(0x1u<<1)
#define	MDF_DFLT5IER_FTHIE_B_0X0		(0x0u<<0)
#define	MDF_DFLT5IER_FTHIE_B_0X1		(0x1u<<0)

// DFLT5ISR Configuration

#define	MDF_DFLT5ISR_RFOVRF				(0x1u<<11)
#define	MDF_DFLT5ISR_CKABF				(0x1u<<10)
#define	MDF_DFLT5ISR_SATF				(0x1u<<9)
#define	MDF_DFLT5ISR_SCDF				(0x1u<<8)
#define	MDF_DFLT5ISR_SSOVRF				(0x1u<<7)
#define	MDF_DFLT5ISR_THHF				(0x1u<<6)
#define	MDF_DFLT5ISR_THLF				(0x1u<<5)
#define	MDF_DFLT5ISR_OLDF				(0x1u<<4)
#define	MDF_DFLT5ISR_RXNEF				(0x1u<<3)
#define	MDF_DFLT5ISR_SSDRF				(0x1u<<2)
#define	MDF_DFLT5ISR_DOVRF				(0x1u<<1)
#define	MDF_DFLT5ISR_FTHF				(0x1u<<0)

#define	MDF_DFLT5ISR_RFOVRF_B_0X0		(0x0u<<11)
#define	MDF_DFLT5ISR_RFOVRF_B_0X1		(0x1u<<11)
#define	MDF_DFLT5ISR_CKABF_B_0X0		(0x0u<<10)
#define	MDF_DFLT5ISR_CKABF_B_0X1		(0x1u<<10)
#define	MDF_DFLT5ISR_SATF_B_0X0			(0x0u<<9)
#define	MDF_DFLT5ISR_SATF_B_0X1			(0x1u<<9)
#define	MDF_DFLT5ISR_SCDF_B_0X0			(0x0u<<8)
#define	MDF_DFLT5ISR_SCDF_B_0X1			(0x1u<<8)
#define	MDF_DFLT5ISR_SSOVRF_B_0X0		(0x0u<<7)
#define	MDF_DFLT5ISR_SSOVRF_B_0X1		(0x1u<<7)
#define	MDF_DFLT5ISR_THHF_B_0X0			(0x0u<<6)
#define	MDF_DFLT5ISR_THHF_B_0X1			(0x1u<<6)
#define	MDF_DFLT5ISR_THLF_B_0X0			(0x0u<<5)
#define	MDF_DFLT5ISR_THLF_B_0X1			(0x1u<<5)
#define	MDF_DFLT5ISR_OLDF_B_0X0			(0x0u<<4)
#define	MDF_DFLT5ISR_OLDF_B_0X1			(0x1u<<4)
#define	MDF_DFLT5ISR_RXNEF_B_0X0		(0x0u<<3)
#define	MDF_DFLT5ISR_RXNEF_B_0X1		(0x1u<<3)
#define	MDF_DFLT5ISR_SSDRF_B_0X0		(0x0u<<2)
#define	MDF_DFLT5ISR_SSDRF_B_0X1		(0x1u<<2)
#define	MDF_DFLT5ISR_DOVRF_B_0X0		(0x0u<<1)
#define	MDF_DFLT5ISR_DOVRF_B_0X1		(0x1u<<1)
#define	MDF_DFLT5ISR_FTHF_B_0X0			(0x0u<<0)
#define	MDF_DFLT5ISR_FTHF_B_0X1			(0x1u<<0)

// OEC5CR Configuration

#define	MDF_OEC5CR_OFFSET				(0x3FFFFFFu<<0)
#define	MDF_OEC5CR_OFFSET_0				(0x1u<<0)

// SNPS5DR Configuration

#define	MDF_SNPS5DR_SDR					(0xFFFFu<<16)
#define	MDF_SNPS5DR_SDR_0				(0x1u<<16)
#define	MDF_SNPS5DR_EXTSDR				(0x7Fu<<9)
#define	MDF_SNPS5DR_EXTSDR_0			(0x1u<<9)
#define	MDF_SNPS5DR_MCICDC				(0x1FFu<<0)
#define	MDF_SNPS5DR_MCICDC_0			(0x1u<<0)

// DFLT5DR Configuration

#define	MDF_DFLT5DR_DR					(0xFFFFFFu<<8)
#define	MDF_DFLT5DR_DR_0				(0x1u<<8)
